import React, { Component } from 'react';
// import { Card, CardTitle, Col } from 'react-materialize';
import { GetData } from '../../functions/GetData';

import InformationList from './InformationList/InformationList';

import './Information.css';

class Information extends Component {

	constructor(props) {
		super(props);
		this.state = {
			allInfo: '',
			ready: false
		}
	}

	componentWillMount() {
		GetData('/getInformation').
		then((result) => {
			this.setState({allInfo: result, ready: true});
		})
	}

	render() {
		if (!this.state.ready) {
			return (<div></div>);
		}

		const info = this.state.allInfo;
		const lists = info.map(
			(record, i) => {
				if (record.type == 'list')
				return record;
			}
		)
		console.log(lists);
		const informationLists = lists.map(
			(record, i) =>
			<InformationList key={i} title={record.title} list={record.content} />
		)
		return (
			<div className="information-container">
				<div className="important-paragraph">
					<p>
						Будь ласка детально ознайомтесь з переліком документів,
						які потрібно мати з собою,
						списком необхідних речей та переліком захворювань,
						з якими ми не можемо прийняти дитину.
					</p>
				</div>
				<div className="paragraph">
					<div className="paragraph-title">Зв'язок та відвідування</div>
					<div className="paragraph-description">
						<p>
							На території садиби є зв’язок тільки оператора Vodafone,
							тому якщо у вашої дитини інший мобільний оператор,
							ви завжди зможете зателефонувати інструктору та дізнатися про все,
							що вас зацікавить і поговорити з дитиною.
							Відвідування дітей вільне, окрім днів,
							коли діти перебувають на виїзних екскурсіях.
							Щоб провести час з своєю дитиною за межами нашої садиби,
							вам потрібно буде заповнити заяву встановленого зразка.
							За межами садиби діти можуть перебувати тільки з батьками (опікунами).
							Прохання мати при собі документи, що засвідчують особу.
						</p>
					</div>
				</div>
				{informationLists}
				<hr />
				<div className="important-paragraph">
					У випадку виявлення у день заїзду дитини хворої або такої,
					що за медичними показниками не може перебувати на відпочинку,
					керівництво зберігає за собою право відмовити у прийнятті її без відшкодування будь-яких витрат чи збитків.
				</div>
			</div>
		);
	}
}

export default Information;


// <div className="information-container">
// 	<div className="important-paragraph">
// 		<p>
// 			Будь ласка детально ознайомтесь з переліком документів,
// 			які потрібно мати з собою,
// 			списком необхідних речей та переліком захворювань,
// 			з якими ми не можемо прийняти дитину.
// 		</p>
// 	</div>
// 	{{htmlList}}
// 	<div className="paragraph">
// 		<div className="paragraph-title">Перелік захворювань, з якими ми не можемо прийняти дитину</div>
// 		<div className="paragraph-description">
// 			<ul>
// 				<li>усі захворювання в гострому періоді</li>
// 				<li>усі форми туберкульозу різних органів і систем</li>
// 				<li>ревматизм в активному та міжприступному періоді, до зняття з диспансерного обліку</li>
// 				<li>набуті чи врождені вади серця та судин</li>
// 				<li>гіпертонічна хвороба</li>
// 				<li>захворювання крові та кровотворних органів</li>
// 				<li>епілепсія чи інші судомні напади та їх еквіваленти</li>
// 				<li>гострі психічні захворювання та реактивні стани</li>
// 				<li>бронхіальна астма</li>
// 				<li>виразкова хвороба шлунку та 12-палої кишки</li>
// 				<li>нефрит, пієлонефрит, сечокамяна хвороба, вроджені аномалії нирок</li>
// 				<li>цукровий діабет, тиреотоксикоз</li>
// 				<li>всі заразні, паразитарні захворювання шкіри (короста, грибкові захворювання, педикульоз і т. д.)</li>
// 				<li>вроджені вади розвитку легень</li>
// 				<li>бронхоектатична хвороба</li>
// 				<li>онкологічні захворювання будь-яких органів та систем</li>
// 				<li>проблеми опорно-рухового апарату, ДЦП</li>
// 				<li>діти які потребують специфічної (спеціальної) дієти (генетичні порушення обміну речовин), не приймаються в зв’язку з неможливістю її забезпечення</li>
// 				<li>при виявленні прихованого діагнозу дитини, що може призвести до виникнення загрозливих для життя станів, батьки зобов’язані негайно забрати дитину додому, без відшкодування будь-яких витрат чи збитків</li>
// 				<li>перед відправкою на відпочинок дітям необхідно пройти огляд стоматолога та провести санацію ротової порожнини</li>
// 				<li>якщо дитина потребує систематичного прийому ліків, це здійснюється під наглядом інструктора, за умови пред’явлення батьками офіційного призначення від лікуючого лікаря</li>
// 			</ul>
// 		</div>
// 	</div>

// </div>
