import React, { Component } from 'react';
// import { Card, CardTitle, Col } from 'react-materialize';
import { GetData } from '../../functions/GetData';

// import CardEvents from './CardEvents/CardEvents';

import './Information.css';

class Information extends Component {

	constructor(props) {
		super(props);
		this.state = {
			ready: true
		}
	}

	componentWillMount() {
		// GetData('/events').then((result) => {
		// 	// console.log(result);
		// 	this.setState({ cards: result});
		// 	this.setState({ ready: true });
		// })
	}

	render() {
		return (
			<div className="information-container">
				<div className="important-paragraph">
					<p>
						Будь ласка детально ознайомтесь з переліком документів,
						які потрібно мати з собою,
						списком необхыдних речей та переліком захворювань,
						з якими ми не можемо прийняти дитину.
					</p>
				</div>
				<div className="paragraph">
					<div className="paragraph-title">Необхідні документи</div>
					<div className="paragraph-description">
						<ul>
							<li>Медична довідка форми 079/О (з обов’язковою відміткою про фізкультурну групу)</li>
							<li>Довідка про епідоточення</li>
							<li>Карта профщеплень</li>
							<li>Копія свідоцтва про народження або паспорта (для трансферу оригінал).</li>
							<li>Заповнена анкета</li>
						</ul>
					</div>
				</div>
				<div className="paragraph">
					<div className="paragraph-title">Що взяти з собою?</div>
					<div className="paragraph-description">
						<ul>
							<li>Сезонний одяг та взуття, втому числі теплі речі (ввечері буває прохолодно)</li>
							<li>Взуття (туристичні вологостійкі черевики, кросівки, босоніжки, гумові тапочки)</li>
							<li>Одяг для святкових заходів</li>
							<li>Головний убір від сонця</li>
							<li>Купальник/плавки</li>
							<li>Шкарпетки (і легкі, і теплі) та нижню білизну в достатній кількості</li>
							<li>Дощовик</li>
							<li>Ліхтарик</li>
							<li>Засоби особистої гігієни</li>
							<li>Вітрозахисна куртка</li>
							<li>Туристична сідушка</li>
							<li>Кишенькові гроші (в кінці зміни їдемо в Івано-Франківськ та відвідуємо кафе, кінотеатр, сувенірний магазин)</li>
						</ul>
					</div>
				</div>
				<div className="paragraph">
					<div className="paragraph-title">Зв'язок та відвідування</div>
					<div className="paragraph-description">
						<p>
							На території садиби є зв’язок тільки оператора Vodafone,
							тому якщо у вашої дитини інший мобільний оператор,
							ви завжди зможете зателефонувати інструктору та дізнатися про все,
							що вас зацікавить і поговорити з дитиною.
							Відвідування дітей вільне, окрім днів,
							коли діти перебувають на виїзних екскурсіях.
							Щоб провести час з своєю дитиною за межами нашої садиби,
							вам потрібно буде заповнити заяву встановленого зразка.
							За межами садиби діти можуть перебувати тільки з батьками (опікунами).
							Прохання мати при собі документи, що засвідчують особу.
						</p>
					</div>
				</div>
				<div className="paragraph">
					<div className="paragraph-title">Перелік захворювань, з якими ми не можемо прийняти дитину</div>
					<div className="paragraph-description">
						<ul>
							<li>усі захворювання в гострому періоді</li>
							<li>усі форми туберкульозу різних органів і систем</li>
							<li>ревматизм в активному та міжприступному періоді, до зняття з диспансерного обліку</li>
							<li>набуті чи врождені вади серця та судин</li>
							<li>гіпертонічна хвороба</li>
							<li>захворювання крові та кровотворних органів</li>
							<li>епілепсія чи інші судомні напади та їх еквіваленти</li>
							<li>гострі психічні захворювання та реактивні стани</li>
							<li>бронхіальна астма</li>
							<li>виразкова хвороба шлунку та 12-палої кишки</li>
							<li>нефрит, пієлонефрит, сечокамяна хвороба, вроджені аномалії нирок</li>
							<li>цукровий діабет, тиреотоксикоз</li>
							<li>всі заразні, паразитарні захворювання шкіри (короста, грибкові захворювання, педикульоз і т. д.)</li>
							<li>вроджені вади розвитку легень</li>
							<li>бронхоектатична хвороба</li>
							<li>онкологічні захворювання будь-яких органів та систем</li>
							<li>проблеми опорно-рухового апарату, ДЦП</li>
							<li>діти які потребують специфічної (спеціальної) дієти (генетичні порушення обміну речовин), не приймаються в зв’язку з неможливістю її забезпечення</li>
							<li>при виявленні прихованого діагнозу дитини, що може призвести до виникнення загрозливих для життя станів, батьки зобов’язані негайно забрати дитину додому, без відшкодування будь-яких витрат чи збитків</li>
							<li>перед відправкою на відпочинок дітям необхідно пройти огляд стоматолога та провести санацію ротової порожнини</li>
							<li>якщо дитина потребує систематичного прийому ліків, це здійснюється під наглядом інструктора, за умови пред’явлення батьками офіційного призначення від лікуючого лікаря</li>
						</ul>
					</div>
				</div>
				<hr />
				<div className="important-paragraph">
					У випадку виявлення у день заїзду дитини хворої або такої,
					що за медичними показниками не може перебувати на відпочинку,
					керівництво зберігає за собою право відмовити у прийнятті її без відшкодування будь-яких витрат чи збитків.
				</div>
			</div>
		);
	}
}

export default Information;
